[MapMixerGUI_CharacterList]
GUIContextMenu_CharacterList.ContextItems=("View Info","Customise")

[MapMixerGUI_CharacterListCustom]
sMenu_Clear="Clear All"
sMenu_CopySelected="Copy Selected"
sMenu_CopyAll="Copy All"
sMenu_Paste="Paste"

[MapMixerGUI_ConfigPage]
sTabLabel_Setup="Setup"
sTabLabel_MapLists="Map Lists"
sTabLabel_FavouriteMaps="Fav Maps"
sTabLabel_GameSourcesLists="Game Lists"
sTabLabel_GameRulesLists="Rule Lists"
sTabLabel_MutatorLists="Mutator Lists"
sTabLabel_GameTypes="Game Types"
sTabLabel_MapDefaults="Map Defaults"
sTabHint_Setup="Configure MapMixer..."
sTabHint_MapLists="Create custom map lists..."
sTabHint_FavouriteMaps="Specify Favourite Map Options..."
sTabHint_GameSourcesLists="Create lists of game types used for Auto-Creating Map Lists..."
sTabHint_GameRulesLists="Create custom game rules lists for game type switching..."
sTabHint_MutatorLists="Create custom mutator lists..."
sTabHint_GameTypes="Create custom game types..."
sTabHint_MapDefaults="Create map default settings per game type..."
sMsg_ExitSaveWarning="Are you sure you want to exit the MapMixer Configuration?||Unsaved changes have been made on the following tabs:||"
GUIHeader_Page.Caption="MapMixer"

[MapMixerGUI_ConfigTab_FavouriteMaps]
sFavMapSources[0]="Single Map List"
sFavMapSources[1]="Game Type Map Lists"
GUICheckBox_ReplaceMap.Caption="Replace Existing Map"
GUICheckBox_ReplaceMap.Hint="Favourite maps replace existing maps instead being inserted"
GUICheckBox_ShuffleSourceList.Caption="Shuffle Source Map List"
GUICheckBox_ShuffleSourceList.Hint="Shuffle the source list before inserting favourites"
GUIComboBox_FavMapSingleList.Caption="Map List Source"
GUIComboBox_FavMapSingleList.Hint="Select a Custom Map List"
GUIComboBox_FavMapSource.Caption="Source Type"
GUIComboBox_FavMapSource.Hint="Select the source for the Favourites selection"
GUIComboBox_GameTypeMapList.Caption="Map List Source"
GUIComboBox_GameTypeMapList.Hint="Select a Custom Map List for the Game Type"
GUINumEditBox_FavMapFequency.Caption="Frequency"
GUINumEditBox_FavMapFequency.Hint="How many maps before a favourite is selected"
GUISectionBackground_Options.Caption="Options"
GUISectionBackground_Source.Caption="Source"

[MapMixerGUI_ConfigTab_GameRulesLists]
GUIButton_Copy.Caption="Copy"
GUIButton_Copy.Hint="Copy the displayed game settings list"
GUIButton_Delete.Caption="Delete"
GUIButton_Delete.Hint="Delete the selected Game Rules List"
GUIButton_New.Caption="New"
GUIButton_New.Hint="Create a new Game Rules List"
GUIButton_Paste.Caption="Paste"
GUIButton_Paste.Hint="Paste the copied game settings to the current settings list"
GUIButton_Save.Caption="Save"
GUIButton_Save.Hint="Save the selected Game Rules List"
GUICheckBox_UseBotSkill.Caption="Bot Skill"
GUICheckBox_UseBotSkill.Hint="Set the Bot Skill for the selected game type"
GUICheckBox_UsePlayerLimits.Caption="Player Limits"
GUICheckBox_UsePlayerLimits.Hint="Place absolute boundaries on the player counts for the selected game type"
GUIEditBox_GameRulesListName.Caption="List Name"
GUIEditBox_GameRulesListName.Hint="Enter a name for your custom Game Rules List"
GUINumEditBox_MaxPlayers.Caption="Hi"
GUINumEditBox_MaxPlayers.Hint="Player counts for the selected game type will never go above this number"
GUINumEditBox_MinPlayers.Caption="Lo"
GUINumEditBox_MinPlayers.Hint="Player counts for the selected game type will never go below this number"
GUISectionBackground_GameRuleLists.Caption="Game Rule Lists"
GUISectionBackground_GameTypesList.Caption="Game Types"

[MapMixerGUI_ConfigTab_GameSourcesLists]
sAllMaps="(All)"
GUIButton_AddGameType.Caption="Add"
GUIButton_AddGameType.Hint="Add the Game Type to the list"
GUIButton_Delete.Caption="Delete"
GUIButton_Delete.Hint="Delete the selected Game Source List"
GUIButton_New.Caption="New"
GUIButton_New.Hint="Clear the Game Source List"
GUIButton_RemoveGameType.Caption="Remove"
GUIButton_RemoveGameType.Hint="Remove the selected Game Type from the list"
GUIButton_Save.Caption="Save"
GUIButton_Save.Hint="Save the selected Game Source List"
GUICheckBox_ShuffleList.Caption="Shuffle List"
GUICheckBox_ShuffleList.Hint="Shuffle the map list for this game type before it is used"
GUIComboBox_FilterMapPrefix.Caption="Map Prefix"
GUIComboBox_FilterMapPrefix.Hint="Only maps with this prefix are used for this game type"
GUIComboBox_FilterName.Caption="Filter Name"
GUIComboBox_FilterName.Hint="Filter Name to be applied to the maps for the selected Game Type"
GUIComboBox_MapListName.Caption="Map List"
GUIComboBox_MapListName.Hint="Map List source for the selected Game Type"
GUIComboBox_MapSource.Caption="Map Source"
GUIComboBox_MapSource.Hint="Map source type for the selected Game Type"
GUIEditBox_GameSourcesListName.Caption="List Name"
GUIEditBox_GameSourcesListName.Hint="Enter a name for your custom Game Maps List"
GUIListBox_GameSources.Hint="Reorder the list using drag and drop"
GUINumEditBox_Priority.Caption="Priority"
GUINumEditBox_Priority.Hint="When using the Priority mode to auto-create a map list, this setting determines the likelihood of the game type being picked at random"
GUISectionBackground_GameSources.Caption="Game Type Map Sources"
GUISectionBackground_GameSourcesLists.Caption="Game Source Lists"
GUISectionBackground_GameTypes.Caption="Game Type List"

[MapMixerGUI_ConfigTab_GameTypes]
sMapSourceTypes[0]="Standard"
sMapSourceTypes[1]="Map List"
sFilterNone="(none)"
sSaveErrorTitle="Save Game Type Failed"
sErr_NotEnoughInfo="Not enough information specified"
sErr_ExistsGameName="Cannot name a Custom Game Type the same as a Base Game Type"
GUIAltSectionBackground_MapPrefixes.Caption="Map Prefixes"
GUIButton_Delete.Caption="Delete"
GUIButton_Delete.Hint="Delete the selected Game Type"
GUIButton_EditGameDesc.Caption="Edit Desc"
GUIButton_EditGameDesc.Hint="Edit Description for this custom Game Type"
GUIButton_EditGameMutators.Caption="Edit Mutators"
GUIButton_EditGameMutators.Hint="Edit Mutators for this custom Game Type"
GUIButton_EditGameRules.Caption="Edit Rules"
GUIButton_EditGameRules.Hint="Edit Rules for this custom Game Type "
GUIButton_LeaderNotifications.Caption="In-game"
GUIButton_LeaderNotifications.Hint="Apply some in-game settings for clients per game type"
GUIButton_New.Caption="New"
GUIButton_New.Hint="Create a new Game Type"
GUIButton_Save.Caption="Save"
GUIButton_Save.Hint="Save the selected Game Type"
GUICheckBox_UsePlayerLimits.Caption="Player Limits"
GUICheckBox_UsePlayerLimits.Hint="Place absolute boundaries on the player counts for this game type"
GUIComboBox_GameBaseClass.Caption="Base Game Type"
GUIComboBox_GameBaseClass.Hint="Select a standard Game Type to base your new one on"
GUIComboBox_MapFilterName.Caption="Map Filter"
GUIComboBox_MapFilterName.Hint="Select a Map List Filter"
GUIComboBox_MapListName.Caption="Map List"
GUIComboBox_MapListName.Hint="Select a Map List"
GUIComboBox_MapSourceType.Caption="Map Source"
GUIComboBox_MapSourceType.Hint="Select the source type for the maps"
GUIEditBox_GameAcronym.Caption="Acronym"
GUIEditBox_GameAcronym.Hint="Enter an identifying acronym for your custom Game Type, eg TDM"
GUIEditBox_GameName.Caption="Game Name"
GUIEditBox_GameName.Hint="Enter a name for your custom Game Type, eg My Deathmatch"
GUIListBox_MapPrefixes.Hint="Select the Map Prefixes that will act as the map sources for your custom Game Type.  If nothing is selected then ALL maps are used."
GUINumEditBox_MaxPlayers.Caption="Hi"
GUINumEditBox_MaxPlayers.Hint="Player counts for the game type will never go above this number"
GUINumEditBox_MinPlayers.Caption="Lo"
GUINumEditBox_MinPlayers.Hint="Player counts for the game type will never go below this number"
GUISectionBackground_GameTypeDesc.Caption="Game Type Description"
GUISectionBackground_GameTypes.Caption="Custom Game Types"

[MapMixerGUI_ConfigTab_MapDefaults]
sGlobalMapClassName="[Default Properties]"
GUIButton_OnslaughtMapDefaults.Caption="ONS Default Links"
GUIButton_OnslaughtMapDefaults.Hint="Toggle Map Info"
GUIButton_ViewMap.Caption="?"
GUIButton_ViewMap.Hint="Toggle Map Info"
GUICheckBox_EditedMaps.Caption="Show Edited Maps"
GUICheckBox_EditedMaps.Hint="Only show maps that have been edited"
GUIComboBox_GameType.Caption="Game Type"
GUIComboBox_GameType.Hint="List the maps of the selected Game Type"
GUISectionBackground_MapList.Caption="Maps"

[MapMixerGUI_ConfigTab_MapLists]
sFilterNone="(none)"
sFilterTemp="(unsaved filter)"
sEditMapButton[0]="Edit Map"
sEditMapButton[1]="Exit Edit"
sHint_CustomMapsList="Custom Maps"
sHint_AvailableMapsList="Available Maps"
sMenu_RemoveMap="Remove"
sMenu_DuplicateMap="Duplicate"
sMenu_GameTypeMap="Game Type"
sMenu_EditMap="Edit"
sMenu_MoveTop="Move Top"
sMenu_MoveUp="Move Up"
sMenu_MoveDown="Move Down"
sMenu_MoveBottom="Move Bottom"
sMenu_TestPlay="Test Play Map"
sMenu_CueFirstMap="Cue as First Map"
sMenu_AddMap="Add"
sMenu_ViewMap="View Info"
sMenu_ViewMiniMap="View Mini Info"
sMenu_FilterReset="Reset Filter"
sMenu_FilterPlayerCount="Filter by Player Count"
sMenu_FilterAuthor="Filter by Author"
sMenu_FilterRating="Filter by Rating"
sMenu_FilterComment="Filter by Comment"
GUIButton_Add.Caption="<"
GUIButton_Add.Hint="Add the selected map to the map list"
GUIButton_AddAll.Caption="<<"
GUIButton_AddAll.Hint="Add all maps to the map list"
GUIButton_ChangeGameType.Caption="Game Type"
GUIButton_ChangeGameType.Hint="Change the map's game type to the one shown on right"
GUIButton_Delete.Caption="Delete"
GUIButton_Delete.Hint="Delete the selected Map List"
GUIButton_DuplicateMap.Caption="Duplicate"
GUIButton_DuplicateMap.Hint="Duplicate the selected map"
GUIButton_EditFilter.Caption="Edit"
GUIButton_EditFilter.Hint="Edit the current map list filter"
GUIButton_EditMap.Hint="Edit map options for the selected map"
GUIButton_FormatMaps.Caption="F"
GUIButton_FormatMaps.Hint="Change the way map names are formatted in the Available Maps List"
GUIButton_MapListMerge.Caption="Merge"
GUIButton_MapListMerge.Hint="Merge the current Map List with a saved list"
GUIButton_MoveBottom.Caption="B"
GUIButton_MoveBottom.Hint="Move the selected map to the bottom of the list"
GUIButton_MoveDown.Caption="D"
GUIButton_MoveDown.Hint="Move the selected map lower down in the list"
GUIButton_MoveTop.Caption="T"
GUIButton_MoveTop.Hint="Move the selected map to the top of the list"
GUIButton_MoveUp.Caption="U"
GUIButton_MoveUp.Hint="Move the selected map higher up in the list"
GUIButton_New.Caption="New"
GUIButton_New.Hint="Clear the Map List"
GUIButton_Remove.Caption=">"
GUIButton_Remove.Hint="Remove the selected map from the map list"
GUIButton_RemoveAll.Caption=">>"
GUIButton_RemoveAll.Hint="Remove all maps from the map list"
GUIButton_Save.Caption="Save"
GUIButton_Save.Hint="Save the selected Map List"
GUIButton_ViewMapAvailable.Caption="?"
GUIButton_ViewMapAvailable.Hint="Left-Click to show Map Info for the right List, Right-Click to show Mini Map Info"
GUIButton_ViewMapComment.Caption="^"
GUIButton_ViewMapComment.Hint="Toggle view Map Author and Map Comments"
GUIButton_ViewMapCustom.Caption="?"
GUIButton_ViewMapCustom.Hint="Left-Click to show Map Info for the left List, Right-Click to show Mini Map Info"
GUIButton_ViewMapRating.Caption="^"
GUIButton_ViewMapRating.Hint="Toggle view Player Counts, Map Rating and Match Count"
GUICheckBox_RemoveAdded.Caption="Remove added"
GUICheckBox_RemoveAdded.Hint="Added maps are moved instead of copied to the Custom List"
GUIComboBox_Filter.Caption="Filter"
GUIComboBox_Filter.Hint="Select a custom Map List Filter"
GUIComboBox_GameType.Caption="Game Type"
GUIComboBox_GameType.Hint="List the maps of the selected Game Type"
GUIComboBox_MapListName.Caption="List Name"
GUIComboBox_MapListName.Hint="Select or enter the name of your custom list"
GUISectionBackground_AvailableMaps.Caption="Available Maps"
GUISectionBackground_CustomMaps.Caption="Custom Maps"

[MapMixerGUI_ConfigTab_MutatorLists]
GUIButton_Delete.Caption="Delete"
GUIButton_Delete.Hint="Delete the selected Mutator List"
GUIButton_New.Caption="New"
GUIButton_New.Hint="Clear the Mutator List"
GUIButton_Save.Caption="Save"
GUIButton_Save.Hint="Save the selected Mutator List"
GUIEditBox_MutatorListName.Caption="List Name"
GUIEditBox_MutatorListName.Hint="Enter a name for your custom mutator list"
GUIListBox_CustomMutatorLists.Hint="Custom Mutators List"
GUISectionBackground_CustomMutatorLists.Caption="Custom Mutator Lists"
GUISectionBackground_GameTypes.Caption="Game Types"

[MapMixerGUI_ConfigTab_Setup]
sNoListName="(none)"
sExtras_EGL="External Game Launch Options"
sExtras_Admin="Admin Options"
sErrMsg_BotMixerVersion="Wrong version of BotMixer Installed!||Required Version: %1||Installed Version: %2"
sMsg_PlayerVsBotWarning="The Players Vs Bots setting will only be relevant for multiplayer team games"
GUIButton_AdminEdit.Caption="Edit"
GUIButton_AdminEdit.Hint="Edit the Admin Rules Lists"
GUIButton_BotMixer.Caption="BotMixer"
GUIButton_BotMixer.Hint="Configure BotMixer"
GUIButton_SettingsDelete.Caption="Delete"
GUIButton_SettingsDelete.Hint="Delete the selected Settings List"
GUIButton_SettingsSave.Caption="Save"
GUIButton_SettingsSave.Hint="Save the current settings"
GUICheckBox_AddServerPackages.Caption="Add Mutator Server Packages"
GUICheckBox_AddServerPackages.Hint="*bAddServerPackages"
GUICheckBox_AutoMapAdvance.Caption="Auto Map List Advance"
GUICheckBox_AutoMapAdvance.Hint="*bAutoMapAdvance"
GUICheckBox_ForceNewMapList.Caption="Init Map List at Next Session"
GUICheckBox_ForceNewMapList.Hint="*bForceMapListInit"
GUICheckBox_ReloadFirstMap.Caption="Reload First Map in Map List"
GUICheckBox_ReloadFirstMap.Hint="*bReloadFirstMap"
GUICheckBox_SwitchGameTypes.Caption="Auto Switch Game Types"
GUICheckBox_SwitchGameTypes.Hint="Switch to the game type of each map in the custom map list"
GUICheckBox_UseBotMixer.Caption="Use BotMixer"
GUICheckBox_UseBotMixer.Hint="*bUseBotMixer"
GUICheckBox_UseFavouriteMaps.Caption="Use Favourite Maps"
GUICheckBox_UseFavouriteMaps.Hint="*bUseFavouriteMaps"
GUICheckBox_UseMapDefaults.Caption="Use Map Defaults"
GUICheckBox_UseMapDefaults.Hint="*bUseMapDefaults"
GUIComboBox_AdminRulesListName.Caption="Setup"
GUIComboBox_AdminRulesListName.Hint="Select an Admin Rules List to use with network games"
GUIComboBox_CustomMapListOrder.Caption="Map Order"
GUIComboBox_CustomMapListOrder.Hint="*tCustomMapListOrderType"
GUIComboBox_DefaultBotSkill.Caption="Default Skill"
GUIComboBox_DefaultBotSkill.Hint="*fDefaultBotSkill"
GUIComboBox_FirstMapActionType.Caption="First Map"
GUIComboBox_FirstMapActionType.Hint="*tFirstMapActionType"
GUIComboBox_GameRulesList.Caption="Game Rules"
GUIComboBox_GameRulesList.Hint="*sGameRulesListName"
GUIComboBox_GameSourceList.Caption="Game List"
GUIComboBox_GameSourceList.Hint="*sGameSourceListName"
GUIComboBox_GameTypeSwitchMethod.Caption="Switch Game"
GUIComboBox_GameTypeSwitchMethod.Hint="*tGameTypeSwitchMethod"
GUIComboBox_MapList.Caption="Map List"
GUIComboBox_MapList.Hint="*sMapListName"
GUIComboBox_MapListRepeat.Caption="End of List"
GUIComboBox_MapListRepeat.Hint="*tMapListRepeatType"
GUIComboBox_MapListSource.Caption="Map Source"
GUIComboBox_MapListSource.Hint="*tMapListSourceType"
GUIComboBox_MutatorList.Caption="Mutator List"
GUIComboBox_MutatorList.Hint="*sMutatorListName"
GUIComboBox_PlayerCountAutoAdjust.Caption="Adjust Level"
GUIComboBox_PlayerCountAutoAdjust.Hint="*tPlayerCountAdjustType"
GUIComboBox_PlayerCountType.Caption="Number of Players"
GUIComboBox_PlayerCountType.Hint="*tPlayerCountType"
GUIComboBox_SessionStartType.Caption="Session Start"
GUIComboBox_SessionStartType.Hint="*tSessionStartType"
GUIComboBox_SettingsListName.Hint="Select a Settings List to Load or enter the name of a new list"
GUIComboBox_SkipCountdown.Caption="Skip Countdown"
GUIComboBox_SkipCountdown.Hint="*tSkipStartCountDown"
GUINumEditBox_AutoGenMapListLength.Caption="Max Map List Length"
GUINumEditBox_AutoGenMapListLength.Hint="*iAutoGenMapListLength"
GUINumEditBox_LevelChangeCountdown.Hint="*iLevelChangeCountdown"
GUINumEditBox_PlayerCountHighest.Caption="Highest"
GUINumEditBox_PlayerCountHighest.Hint="*tPlayerCountHighest"
GUINumEditBox_PlayerCountLowest.Caption="Lowest"
GUINumEditBox_PlayerCountLowest.Hint="*tPlayerCountLowest"
GUINumEditBox_SwitchNumber.Caption="Game Type Period"
GUINumEditBox_SwitchNumber.Hint="*iGameTypeSwitchPeriod"
GUISectionBackground_MapList.Caption="Session Map List"
GUISectionBackground_Match.Caption="Match Start and End"
GUISectionBackground_Misc.Caption="Miscellaneous"
GUISectionBackground_PlayerCounts.Caption="Player Counts"

[MapMixerGUI_Footer_ConfigLeft]
GUIButton_Dedicated.Caption="DEDICATED"
GUIButton_Dedicated.Hint="Launch a Dedicated MapMixer Server game using the current settings"
GUIButton_Listen.Caption="LISTEN"
GUIButton_Listen.Hint="Launch a Listen MapMixer Server game using the current settings"
GUIButton_Play.Caption="PLAY"
GUIButton_Play.Hint="Launch a Single Player MapMixer game using the current settings.  Hold down the Shift key to launch in Spectator mode."

[MapMixerGUI_Footer_ConfigRight]
GUIButton_Client.Caption="CLIENT"
GUIButton_Client.Hint="Configure the MapMixer Client Settings"
GUIButton_Done.Caption="DONE"
GUIButton_Done.Hint="Finish configuring MapMixer"
GUIButton_Hints.Caption="HINTS"
GUIButton_Hints.Hint="Get useful information on using MapMixer.  Full documentation is in the Help folder."
GUIButton_Keys.Caption="KEYS"
GUIButton_Keys.Hint="Configure the MapMixer Command Keys"
GUIButton_Options.Caption="OPTIONS"
GUIButton_Options.Hint="Set MapMixer options"

[MapMixerGUI_GameMainMenu]
GUIButton_Config.Caption="MapMixer"
GUIButton_Config.Hint="Launch a MapMixer Controlled Game"

[MapMixerGUI_List_FavMapGameTypes]
ColumnHeadings=("Game Type","Map List Name")

[MapMixerGUI_List_GameSourcesList]
sGameMapSourceTypes[0]="All Game Type Maps"
sGameMapSourceTypes[1]="Custom Map List"
sGameMapSourceTypes[2]="Map List Filter"
ColumnHeadings=("Game Type","Source","List","Shuffle","Pri")

[MapMixerGUI_List_GameTypeClientHelpers]
ColumnHeadings=("Game Type","Notification","HUD Players")

[MapMixerGUI_List_MapsAvailable]
ColumnHeadings=("Map Name",,)

[MapMixerGUI_List_MapsCustom]
ColumnHeadings=("Game Type","Map Name")

[MapMixerGUI_List_Mutators]
sMutatorStateNames[1]="Enabled"
sMutatorStateNames[2]="Disabled"
sMutatorStateNames[3]="Rand (%1)"
sMenu_Enable="Enable"
sMenu_Clear="Clear"
sMenu_Random="Random"
sMenu_Disable="Disable"
sMenu_Edit="Open Config"
ColumnHeadings=("Mutator Name","Group","State")

[MapMixerGUI_List_OnslaughtMapLinkSetups]
ColumnHeadings=("Map Name","Default Link Setup")

[MapMixerGUI_List_Settings]
ColumnHeadings=("Setting","Value")

[MapMixerGUI_Menu_AdminRules]
WindowName="Admin Rules Lists"
GUIButton_Delete.Caption="Delete"
GUIButton_Delete.Hint="Delete selected Admin Rules"
GUIButton_New.Caption="New"
GUIButton_Okay.Caption="Close"
GUIButton_Save.Caption="Save"
GUIButton_Save.Hint="Save current Admin Rules"
GUIEditBox_RulesName.Caption="Name"
GUIEditBox_RulesName.Hint="Enter a name for your custom Admin Rules"
GUISectionBackground_Rules.Caption="Admin Rules"
GUISectionBackground_RulesLists.Caption="Admin Rules Lists"

[MapMixerGUI_Menu_GameTypeClientHelper]
WindowName="Game Type Leader Notifications"
GUIButton_Cancel.Caption="Cancel"
GUIButton_Cancel.Hint="Exit without applying changes"
GUIButton_Okay.Caption="Okay"
GUIButton_Okay.Hint="Accepts Changes"

[MapMixerGUI_Menu_HelpfulHints]
sHintGroups[0]="General"
sHintGroups[1]="About"
sHintGroups[2]="Setup"
sHintGroups[3]="Map List"
sHintGroups[4]="Favourite Maps"
sHintGroups[5]="Game Lists"
sHintGroups[6]="Rule Lists"
sHintGroups[7]="Mutator Lists"
sHintGroups[8]="Game Types"
sHintGroups[9]="Map Defaults"
sHintGroups[10]="Keys & Commands"
sHintGroups[11]="Client"
sHintGroups[12]="Other Info"
sHints[0]="Select a topic on the left for helpful hints.||Refer to the full MapMixer documentation in the UT2004 Help folder for more info.||MapMixer also provides extra functionality via in-game console commands.||It is recommended that you enable the 'Main Menu Shortcut' in the MapMixer Options Menu.  This enables quick access to the MapMixer Config from the UT2004 Main Menu.||You may also launch your game using the buttons at the bottom left of the screen. (Shift-Click Play for spectator games.)"
sHints[2]="The Setup Tab contains the general settings that control MapMixer.||The [Session Start] options allows you to resume the previous session's map list at various points.||The [Source Type] option defines the type of map list.||When you allow MapMixer to switch between Game Types it requires a Rule List, otherwise it uses the rules that started the match.||You can manually specify the first map for a session by right-clicking a map in the Map List Editor and selecting 'Cue as first map'.||The options in the Setup Tab can be saved (see top right of Setup) and loaded in-game."
sHints[3]="The Map List Editor allows you to create custom map lists where each map can be from any game type and contain its own Game Rules, Mutators, Bot Skill and Player Counts.||Use Drag and Drop to add and remove maps from the Custom Map List.|Reorder maps by dragging them to a new location.||Click on list column headers to sort.||Both lists have Context Menus (right click).||Keyboard shortcuts:|<Enter> to add/remove map|<delete> to remove map|<Control + Up or Down> to Move a map.|<Shift + Up or Down> to move a map to the top or bottom.|<Control + C> to copy a map.|<Control + X> to cut a map.|<Control + V> to paste a map.|<Any Letter> to jump to a map beginning with that letter.|<Space> to switch lists|<F1 or Middle MB> to show MapInfo|<SHIFT + (F1 or Middle MB)> to show MiniMapInfo|<F2> Edit Custom Map|<F4> to change Custom Map's game type|<F8> to Cue First Map"
sHints[4]="The Favourite Maps feature modifies the current map list by inserting or replacing maps at regular intervals.|Either use a single map list as a Favourites source or specify a list for each game type.||Favourite Maps is not available when using manual game type switching.||See documentation for full info."
sHints[5]="Game Lists allow you to define what game types are used when auto-creating map lists from multiple game types.  The [Switch Games] option on the Setup Page defines how these game types are used to construct a map list.||You may use drag-and-drop to reorder the game types in the list you create.  This order can be optionally used when generating the map list.||Don't forget to create a Rule List to use with your Game List."
sHints[6]="Rule Lists contain a list of all game types and their rules and are essential when any form of game type switching occurs; either in a Custom Map List or a Game List."
sHints[7]="Mutator Lists contain a seperate list of mutators for each game type.||Mutators can be either Enabled, Randomly Enabled or Disabled.||Keyboard shortcuts for Mutator List:|<e> or <+> Enable Mutator|<d> or <-> Disable Mutator|<R> Randomly Enable Mutator - type two digits to set the chance|<Space> Reset State"
sHints[8]="Custom Game Types are user-customised versions of standard game types.  They contain their own Map Prefixes, Game Rules and Mutators, allowing you to specialise your own game types.||For example, you could create your own Deathmatch that uses special weapon mutators."
sHints[9]="Map Defaults allow you to set default Game Rules, Mutators, Player Counts, Bot Skill and Custom Bots for a map in each game type.||The [Default Properties] list contains generic map settings regardless of game type and not all settings are available because this list is assigned no specific game type.  Both lists can be used in conjunction with each other but map settings in the Game Type lists override the [Default Properties] list.||Use the [Show Edited Maps] option to list the maps you have edited.||The 'Clear Map Edits' button will remove any edits from the map in the current game type and display it as unedited."
sHints[10]="The Keys Menu allows you to bind some common MapMixer in-game functions to keys.||Each of these functions is actually a MapMixer console command.||MapMixer supports some console commands allowing you to modify the game while it is running.  You could for example, add maps to the map list."
sHints[11]="Some MapMixer functions and settings are client specific.  In single player games you are the Client and in network games every human player is a Client.||The Client Menu allows each client to configure these settings for their machine.||The 'Client' button here is just a shortcut to this local machine's settings and does not affect other players."
sHints[12]="MapMixer provides control over Game Rules, Mutators, Player Counts and Bot Skill at various different points (or levels).  It is important to understand the priority that is given to each setting, so you know which settings will override another.  For example, a game rule in the Rules List can be overriden by a map in the map list. Read the full documentation for details on which settings will override another.||In network games some in-game functions require players to be logged on as admins. You can either manually login using the UT 'adminlogin' console command or MapMixer can log you in automatically when you connect.  See the Client Config Menu where you can specify Server Names and Passwords for auto-logins."
WindowName="MapMixer Helpful Hints"
GUIAltSectionBackground_Hint.Caption="Hints"
GUIAltSectionBackground_HintGroups.Caption="Topics"

[MapMixerGUI_Menu_MapFilter]
WindowName="Map List Filter"
GUIAltSectionBackground_Filter.Caption="Filter Options"
GUIButton_Cancel.Caption="Cancel"
GUIButton_Cancel.Hint="Exit without applying any filter changes"
GUIButton_Delete.Caption="Delete"
GUIButton_Delete.Hint="Delete selected filter"
GUIButton_ListDown.Hint="Move the selected Filter up the list."
GUIButton_ListUp.Hint="Move the selected Filter down the list."
GUIButton_New.Caption="New"
GUIButton_New.Hint="Clear the filter options"
GUIButton_Okay.Caption="Okay"
GUIButton_Okay.Hint="Apply the current filter options"
GUIButton_Save.Caption="Save"
GUIButton_Save.Hint="Save current filter"
GUICheckBox_OfficialMaps.Caption="Official Maps"
GUICheckBox_OfficialMaps.Hint="Only include maps created by Epic or Digital Extremes"
GUICheckBox_UseMapRatings.Caption="Map Ratings"
GUICheckBox_UseMapRatings.Hint="Use Map Ratings in the Filter"
GUICheckBox_UseMatchesPlayed.Caption="Matches Played"
GUICheckBox_UseMatchesPlayed.Hint="Use Matches Played in the Filter"
GUIEditBox_FilterName.Caption="Name"
GUIEditBox_FilterName.Hint="Enter a name for your custom Map Filter"
GUIEditBox_MapAuthor.Caption="Map Author"
GUIEditBox_MapAuthor.Hint="Authors containing this"
GUIEditBox_MapComment.Caption="Map Comment"
GUIEditBox_MapComment.Hint="Only show maps with user comments containing this"
GUIEditBox_MapName.Caption="Map Name"
GUIEditBox_MapName.Hint="Map Names containing this"
GUINumEditBox_MaxMapRating.Caption="to"
GUINumEditBox_MaxMapRating.Hint="Match maps rated up to this value"
GUINumEditBox_MaxPlayed.Caption="to"
GUINumEditBox_MaxPlayed.Hint="Match maps with matches played up to this value"
GUINumEditBox_MaxPlayers.Caption="to"
GUINumEditBox_MaxPlayers.Hint="Recommended Player Counts"
GUINumEditBox_MinMapRating.Hint="Match maps rated from this value"
GUINumEditBox_MinPlayed.Hint="Match maps with matches played from this value"
GUINumEditBox_MinPlayers.Caption="Players Counts"
GUINumEditBox_MinPlayers.Hint="Recommended Player Counts"
GUISectionBackground_FilterLists.Caption="Custom Filters"

[MapMixerGUI_Menu_MapFormatter]
sGroupNameTypes[0]="Ignore"
sGroupNameTypes[1]="Remove"
sGroupNameTypes[2]="Postfix"
WindowName="Map Name Formatter"
GUIButton_Add.Caption="Add"
GUIButton_Add.Hint="Add a new Group Name"
GUIButton_Cancel.Caption="Cancel"
GUIButton_Cancel.Hint="Exit without applying any changes"
GUIButton_Okay.Caption="Okay"
GUIButton_Okay.Hint="Apply the current options"
GUIButton_Remove.Caption="Remove"
GUIButton_Remove.Hint="Remove the current Group Name"
GUICheckBox_RemovePrefix.Caption="Remove Map Prefix"
GUICheckBox_RemovePrefix.Hint="The Map will be displayed without its prefix, eg DM-Asbestos becomes Asbestos"
GUIComboBox_GroupAction.Caption="Group Name Action"
GUIComboBox_GroupAction.Hint="What happens to recognised Group Names"
GUIEditBox_GroupName.Hint="Enter Group Name and click Add to store it"
GUISectionBackground_GroupNames.Caption="Group Names"

[MapMixerGUI_Menu_OnslaughtDefaults]
WindowName="Onslaught Map Default Power Node Links"
GUIButton_Cancel.Caption="Cancel"
GUIButton_Cancel.Hint="Exit without applying changes"
GUIButton_Okay.Caption="Okay"
GUIButton_Okay.Hint="Accepts Changes"
GUIComboBox_LinkSetups.Caption="Default Link Setup"
GUIComboBox_LinkSetups.Hint="Select the default link setup for the selected Onslaught map"

[MapMixerGUI_Menu_Options]
sAttention="Attention"
sMsg_MainMenuClassWarning="MapMixer has enabled it's own version of the UT2004 Main Menu.|This option must be switched off first if you plan to uninstall MapMixer.||Further information is available in the MapMixer documentation."
sMsg_ScaleConfirm="This will proportionally scale the rating of every rated map to the new maximum map rating value.||Are you sure you want to do this?"
WindowName="MapMixer Options"
GUIButton_Cancel.Caption="Cancel"
GUIButton_ClearStats.Caption="Clear"
GUIButton_ClearStats.Hint="Clear and initialise the current MapMixer Session Statistics"
GUIButton_Okay.Caption="Okay"
GUIButton_ScaleMapRating.Caption="Set"
GUIButton_ScaleMapRating.Hint="Scale all rated maps using the new maximum rating value"
GUICheckBox_LockStats.Caption="Lock Session Stats"
GUICheckBox_LockStats.Hint="Lock MapMixer Session Statistics, so they are never cleared."
GUICheckBox_MainMenuShortcut.Caption="Enable MapMixer shortcut in UT2004 Main Menu"
GUICheckBox_MainMenuShortcut.Hint="Enables quick access to the MapMixer Config Menu from the UT2004's Main Menu (requires game restart).  Note that you must first disable this option if you plan to uninstall MapMixer!"
GUINumEditBox_MaxMapRating.Caption="Max Map Rating"
GUINumEditBox_MaxMapRating.Hint="Adjust the maximum possible rating for a map."

[MapMixerGUI_Menu_TestPlayMap]
WindowName="MapMixer Test Play Map"
GUIAltSectionBackground_GameRules.Caption="Game Rules"
GUIButton_Close.Caption="Close"
GUIButton_Play.Caption="Play"
GUIComboBox_BotSkill.Caption="Bot Skill"
GUIComboBox_BotSkill.Hint="Select the bot skill to test play the map with"
GUIComboBox_GameType.Caption="Game Type"
GUIComboBox_GameType.Hint="Select the game type to test the map in"
GUIEditBox_MapName.Caption="Map Name"
GUIEditBox_MapName.Hint="Name of the map to play"
GUINumEditBox_NumBots.Caption="Num Bots"
GUINumEditBox_NumBots.Hint="Number of bots to test play the map with"

[MapMixerGUI_Panel_CustomBots]
sTitle_NoTeam="Custom Bot List"
sTitle_BlueTeam="Blue Team Bot List"
sTitle_sRedTeam="Red Team Bot List"

[MapMixerGUI_Panel_GameRuleOverrides]
GUIButton_RuleAdd.Caption="Add"
GUIButton_RuleAdd.Hint="Add the selected Rule to the list"
GUIButton_RuleRemove.Caption="Remove"
GUIButton_RuleRemove.Hint="Remove the selected Rule from the list"
GUIListBox_AvailableGameRules.Hint="Available Game Rules"
GUISectionBackground_AvailableGameRules.Caption="Available Game Rules"

[MapMixerGUI_Panel_MapEdit]
GUIButton_EditBots.Caption="Bots"
GUIButton_EditBots.Hint="Edit Map Bots"
GUIButton_EditMutators.Caption="Mutators"
GUIButton_EditMutators.Hint="Edit Map Mutators"
GUIButton_EditRules.Caption="Rules"
GUIButton_EditRules.Hint="Edit Map Rules"
GUIButton_ResetAll.Caption="Clear"
GUIButton_ResetAll.Hint="Remove all edits to this map"
GUICheckBox_UseBotSkill.Caption="Bot Skill"
GUICheckBox_UseBotSkill.Hint="Adjust the bot skill"
GUICheckBox_UsePlayerCounts.Caption="Player Counts"
GUICheckBox_UsePlayerCounts.Hint="Alter the recommended min and max player counts"
GUIComboBox_BotSkill.Caption="Bot Skill"
GUINumEditBox_MaxPlayers.Caption="Max"
GUINumEditBox_MinPlayers.Caption="Min"

[MapMixerGUI_Panel_MapImage]
GUILabel_NoPreview.Caption="No Preview Available"

[MapMixerGUI_Panel_MapInfo]
sNoMapInfo="No information available!"
sAuthorText="Author"
sPlayerText="players"
sPlayedTimes="Matches:"
sMapModes[0]="Edit"
sMapModes[1]="Desc"
GUIAltSectionBackground_Scroll.Caption="Map Desc"
GUIButton_Mode.Hint="Switch between Map Description and Map Info Edit"
GUIEditBox_Comment.Caption="Comment"
GUILabel_MapAuthor.Caption="Testing"
GUILabel_RecommendedPlayers.Caption="Best for 4 to 8 players"
GUINumEditBox_Rating.Caption="Rating"
GUISectionBackground_Panel.Caption="Map Info"

[MapMixerGUI_Panel_MiniMapInfo]
GUILabel_MapName.Caption="Testing"

[MapMixerGUI_Panel_Mutators]
GUIButton_ConfigureMutators.Caption="Configure Mutators"
GUIButton_ConfigureMutators.Hint="Configure the selected Mutators"
GUIButton_Copy.Caption="Copy"
GUIButton_Copy.Hint="Copy the displayed mutator list"
GUIButton_Paste.Caption="Paste"
GUIButton_Paste.Hint="Paste the copied mutators to the current list"
GUIListBox_Mutators.Hint="Right Click, Double Click to cycle, Press +, -, R(0 to 9) or Space"
GUISectionBackground_Mutators.Caption="Mutators"

[MapMixerGUI_Panel_Settings]
GUIFloatEditBox_MaxValue.Caption="to"
GUIFloatEditBox_MaxValue.Hint="Optional Max Value for randomisation"
GUINumEditBox_MaxValue.Caption="to"
GUINumEditBox_MaxValue.Hint="Optional Max Value for randomisation"
GUINumEditBox_Probability.Caption="%"
GUINumEditBox_Probability.Hint="Probability that the setting will be enabled"
GUISectionBackground_Panel.Caption="Game Rules"

